## dev: ses
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 16 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.ses_sender will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ses_sender"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ses:SendRawEmail",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_iam_access_key.ses_smtp_user will be created
  + resource "aws_iam_access_key" "ses_smtp_user" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "ses_smtp_user"
    }

  # aws_iam_policy.ses_sender will be created
  + resource "aws_iam_policy" "ses_sender" {
      + arn         = (known after apply)
      + description = "Allows sending email via SES"
      + id          = (known after apply)
      + name        = "ses_sender"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_user.ses_smtp_user will be created
  + resource "aws_iam_user" "ses_smtp_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "ses_smtp_user"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy_attachment.ses_sender_policy_attach will be created
  + resource "aws_iam_user_policy_attachment" "ses_sender_policy_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "ses_smtp_user"
    }

  # aws_route53_record.platform_mvp_dkim[0] will be created
  + resource "aws_route53_record" "platform_mvp_dkim" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = "Z0827871K14BE7AFQQHA"
    }

  # aws_route53_record.platform_mvp_dkim[1] will be created
  + resource "aws_route53_record" "platform_mvp_dkim" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = "Z0827871K14BE7AFQQHA"
    }

  # aws_route53_record.platform_mvp_dkim[2] will be created
  + resource "aws_route53_record" "platform_mvp_dkim" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = "Z0827871K14BE7AFQQHA"
    }

  # aws_route53_record.platform_mvp_ses_verification will be created
  + resource "aws_route53_record" "platform_mvp_ses_verification" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 600
      + type            = "TXT"
      + zone_id         = "Z0827871K14BE7AFQQHA"
    }

  # aws_ses_domain_dkim.platform_mvp_domain_dkim will be created
  + resource "aws_ses_domain_dkim" "platform_mvp_domain_dkim" {
      + dkim_tokens = (known after apply)
      + domain      = "platform.cdssandbox.xyz"
      + id          = (known after apply)
    }

  # aws_ses_domain_identity.platform_mvp_sending_domain will be created
  + resource "aws_ses_domain_identity" "platform_mvp_sending_domain" {
      + arn                = (known after apply)
      + domain             = "platform.cdssandbox.xyz"
      + id                 = (known after apply)
      + verification_token = (known after apply)
    }

  # aws_ses_domain_identity_verification.platform_mvp_domain_verification will be created
  + resource "aws_ses_domain_identity_verification" "platform_mvp_domain_verification" {
      + arn    = (known after apply)
      + domain = (known after apply)
      + id     = (known after apply)
    }

  # aws_ses_domain_mail_from.platform_mvp_domain_mail_from will be created
  + resource "aws_ses_domain_mail_from" "platform_mvp_domain_mail_from" {
      + behavior_on_mx_failure = "UseDefaultValue"
      + domain                 = "platform.cdssandbox.xyz"
      + id                     = (known after apply)
      + mail_from_domain       = "mail.platform.cdssandbox.xyz"
    }

  # aws_ses_identity_notification_topic.cplatform_mvp_ses_delivery_topic will be created
  + resource "aws_ses_identity_notification_topic" "cplatform_mvp_ses_delivery_topic" {
      + id                       = (known after apply)
      + identity                 = "platform.cdssandbox.xyz"
      + include_original_headers = false
      + notification_type        = "Delivery"
      + topic_arn                = (known after apply)
    }

  # aws_ses_identity_notification_topic.platform_mvp_ses_bounce_topic will be created
  + resource "aws_ses_identity_notification_topic" "platform_mvp_ses_bounce_topic" {
      + id                       = (known after apply)
      + identity                 = "platform.cdssandbox.xyz"
      + include_original_headers = false
      + notification_type        = "Bounce"
      + topic_arn                = (known after apply)
    }

  # aws_ses_identity_notification_topic.platform_mvp_ses_complaint_topic will be created
  + resource "aws_ses_identity_notification_topic" "platform_mvp_ses_complaint_topic" {
      + id                       = (known after apply)
      + identity                 = "platform.cdssandbox.xyz"
      + include_original_headers = false
      + notification_type        = "Complaint"
      + topic_arn                = (known after apply)
    }

  # aws_sns_topic.platform_mvp_ses will be created
  + resource "aws_sns_topic" "platform_mvp_ses" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = "alias/aws/sns"
      + name                        = "ses-notifications"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags_all                    = (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ses_smtp_password = (sensitive value)
  + ses_smtp_username = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>